#+TITLE: DM1 Week 03 Prepare and Teach
#+LANGUAGE: en
#+OPTIONS: H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t
#+OPTIONS: html-postamble:nil
#+STARTUP: showeverything entitiespretty
#+SETUPFILE: ../theme-bigblow.setup
#+BEGIN: clocktable :maxlevel 2 :scope file
#+CAPTION: Clock summary at [2018-02-06 Tue 14:28]
| Headline                                   |   Time |      |
|--------------------------------------------+--------+------|
| *Total time*                               | *2:32* |      |
|--------------------------------------------+--------+------|
| Prepare                                    |   1:49 |      |
| \_  Read...                                |        | 0:38 |
| \_  Answer What is True about Why Teach... |        | 0:16 |
| \_  Answer What is True about your ICE...  |        | 0:55 |
| Teach                                      |   0:43 |      |
#+END:
* Instructions
  See [[file:../week00/00-ponder--prove.org]]

* Prepare
** DONE Read [[https://firstthreeodds.org/17657741833134731255/why-teach-logic.pdf][Why Teach Logic?]]
   CLOSED: [2018-01-27 Sat 16:41]
   :LOGBOOK:
   CLOCK: [2018-01-27 Sat 16:03]--[2018-01-27 Sat 16:41] =>  0:38
   :END:

** DONE Answer What is True about Why Teach Logic?
   CLOSED: [2018-01-27 Sat 16:57]
   :LOGBOOK:
   CLOCK: [2018-01-27 Sat 16:41]--[2018-01-27 Sat 16:57] =>  0:16
   :END:
  If you can truthfully assert any of the following, you know what to do:

  - [X] I know why \ldquo{}It depends\rdquo is the correct answer to the question: True or
    False? Zero is a member of the set of *Natural* numbers.
  - [X] I know that statements saying such-and-such elements are members of
    so-and-so sets are *propositions*.
  - [X] I know that \ldquo{}Whatever is written by a famous person is true\rdquo is called
    the \ldquo{}Appeal to Authority\rdquo fallacy.
  - [X] I know that \ldquo{}Whatever is believed by a large number of people is true\rdquo
    is called the \ldquo{}Bandwagon\rdquo fallacy.
  - [X] I know the difference between a /valid/ argument and a /sound/
    argument.
  - [X] I know why it is *false* to say that Zeezrom tried to fool Alma and
    Amulek with a /Hasty Generalization/ argument.
  - [X] I know that to study something out in one’s mind requires more than
    just gathering facts; it requires reasoning out the logical relationships
    among the facts.
  - [X] I know who said: \ldquo{}The mind should be trained to study, to reflection,
    to system [...] [This mental labor will] yield fruits satisfactory to
    itself, and useful in the salvation of others.\rdquo - Orson Pratt
  - [X] I know that the proud despise reason because it destroys their craft.
  - [X] I know who said \ldquo{}We are free to think [,plan and do]. But once an
    action has been taken, we are never free from its consequences.\rdquo - Russel M. Nelson
  - [X] I know that logic, like language, must be studied and understood in
    order to be used effectively.

** DONE Answer What is True about your ICE Preparation
   CLOSED: [2018-01-30 Tue 13:28]
   :LOGBOOK:
   CLOCK: [2018-01-30 Tue 12:25]--[2018-01-30 Tue 13:14] =>  0:49
   CLOCK: [2018-01-27 Sat 17:07]--[2018-01-27 Sat 17:13] =>  0:06
   :END:
   ICE = In-Class Exercise

   Check the box if you can truthfully assert that you did any of the following
   before Week 03 Day 1 class starting time.
  - [X] I reviewed my solution to last week\rsquo{}s /census-taker problem/.
  - [X] I identified the \ldquo{}key move\rdquo required to see the answer, and came
    prepared to articulate it if called upon.
  - [X] I found two or three classmates (the same as last week, or different
    ones) to form a team for an in-class exercise described below under *Teach*.
  - [X] I started discussing with my team how to compare/contrast terms as
    warmup for the main *Teach* task. For example, compare and contrast pairs of
    the four terms
    1. immortality
    2. salvation
    3. eternal life
    4. exaltation
    taking the pairs across the two rows (e.g., immortality versus salvation) or
    down the two columns (e.g. immortality versus eternal life) of the following
    table, where the column headings give a hint:
    | Moses 1:39   | Nouns meaning "the action of (a verb)" or "the result of (a verb)" | Analysis                                                              |
    |--------------+--------------------------------------------------------------------+-----------------------------------------------------------------------|
    | immortality  | salvation                                                          | Immortality = live forever, while salvation = saved from sins.        |
    | eternal life | exaltation                                                         | Eternal life and Exaltation are equal - You live with God forever.    |
    | salvation    | eternal life                                                       | Salvation = saved from sins, eternal life = live with God forever.    |
    | exaltation   | immortality                                                        | Exaltation = Live with God forever, Immortality = Live forever.       |
    | immortality  | eternal life                                                       | Same as above                                                         |
    | salvation    | exaltation                                                         | Salvation = saved from sins, while exaltation = Live with God forever |
    |              |                                                                    |                                                                       |

* Teach
  :LOGBOOK:
  CLOCK: [2018-01-30 Tue 12:45]--[2018-01-30 Tue 13:28] =>  0:43
  :END:
  Recall the /polygon circumscribing/ (AKA /limiting radius/) problem? The
  limiting radius (r_\infty) of the outermost circle is 8.700 (approximately).

  There are reasons finding the value of this radius is an exercise/problem in
  /discrete/ mathematics (one is because algorithms are step-by-step discrete
  things, another is that the answer can only be given with finite precision,
  which is a discrete math idea) and there are reasons for it being /continuous/
  mathematics (because you can do it without a computer, and the answer is a
  /real/ number, which is a continuous math idea). In other words, it depends!

  Whether or not this was an exercise (versus a problem) depends on if on first
  contact you immediately knew how to answer it or not!

  Below are two computational solutions to this problem, one in C++, one in
  elisp. The exercise of your thinking and writing skills is to compare and
  contrast the two. Bear in mind that to be responsive at all there should be
  at least one point of comparison (telling how they are the same) and at least
  one point of contrast (telling how they are different), and preferably two or
  more of each.

#+BEGIN_SRC C++ :var num=10000000 :results output
  #include <iostream>
  #include <iomanip>
  #include <cmath>
  #include <ctime>
  #include <cstdlib>
  using namespace std;

  double limitingRadius(long numSides)
  {
     double radius = 1.0;
     for (long i = 3; i < numSides; i++)
     {
        radius /= cos(M_PI / i);
     }
     return radius;
  }

  int main(int argc, const char* argv[])
  {
     int n = (argc < 2) ? num : atol(argv[1]);
     clock_t start = clock();
     double result = limitingRadius(n);
     clock_t end = clock();
     cout << "Calculated " << setprecision(17) << result
          << " with " << num << " iterations in "
          << (end - start) / (double) CLOCKS_PER_SEC
          << " seconds.\n";
     return 0;
  }
#+END_SRC

#+RESULTS:
: Calculated 8.7000323319141764 with 10000000 iterations in 0.29699999999999999 seconds.

#+BEGIN_SRC emacs-lisp :results silent
  (defun limiting-radius (num-sides)
    (loop with result = 1.0
          for i from 3 below num-sides
          do (setq result (/ result (cos (/ pi i))))
          finally return result))

  (defun calculate-limiting-radius (num-sides)
    (let* ((start (float-time))
           (result (limiting-radius num-sides))
           (end (float-time)))
      (format "Calculated %.17f with %d iterations in %.17f seconds."
              result num-sides (- end start))))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (calculate-limiting-radius 100000)
#+END_SRC

#+RESULTS:
: Calculated 8.69960730405618676 with 100000 iterations in 0.05644941329956055 seconds.

#+BEGIN_SRC emacs-lisp
  (calculate-limiting-radius 1000000)
#+END_SRC

#+RESULTS:
: Calculated 8.69999369233345732 with 1000000 iterations in 0.49365091323852539 seconds.

#+BEGIN_SRC emacs-lisp
  (calculate-limiting-radius 10000000)
#+END_SRC

#+RESULTS:
: Calculated 8.70003233192909420 with 10000000 iterations in 7.01773118972778320 seconds.

#+begin_info
Differences: 
           - C++ compiles many times more quickly than emacs-lisp.
           - E-Lisp doesn't have to import libraries, while C++ does.
           - E-Lisp has to run the functions first and then use the function in a seperate instance.
           - C++ is longer code.
           - E-Lisp doesn't have a main.
Similarities: 
           - Both implement 2 separate functions.
           - Both have set precision to 17.
           - It is the same exact program, just transcribed to different languages.
           - Both use loops.
#+end_info

#+BEGIN_SRC python :results output
from math import *
import time
product, iterations, start = 1.0, 10000000, time.process_time()
for n in range(3, iterations):
  product *= (1/cos(pi/n))
print("Calculated {} with {} iterations in {} seconds.".format(product, iterations, (time.process_time()-start)))
#+END_SRC

#+RESULTS:
: Calculated 8.700032336799667 with 10000000 iterations in 5.546875 seconds.

